configuration/src/Catalogs/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиПользователей</name>
  <comment>Список возможных ролей пользователя</comment>
  <predefined>
    <items>
      <name>Аналитик</name>
      <description>Аналитик</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Гость</name>
      <description>Гость</description>
    </items>
    <items>
      <name>ДиректорIT</name>
      <description>Директор IT</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Разработчик</name>
      <description>Разработчик</description>
    </items>
    <items>
      <name>РуководительIT</name>
      <description>Руководитель ИТ-отдела</description>
    </items>
    <items>
      <name>РуководительНаправления</name>
      <description>Руководитель направления</description>
    </items>
    <items>
      <name>РуководительНаправленияIT</name>
      <description>Руководитель направления IT</description>
    </items>
    <items>
      <name>СтаршийРазработчик</name>
      <description>Старший разработчик</description>
    </items>
    <items>
      <name>СТО</name>
      <description>СТО</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
  </predefined>
  <attributes>
    <name>ПринадлежитITОтделу</name>
    <comment>Истина - определяет роль пользователя в IT-структуре, Ложь - роль пользователя по отношению к объектам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеИнструменты</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.ИнструментыСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОтчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/ИнструментыСистемы/ИнструментыСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнструментыСистемы</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Добавить</name>
      <description>Добавить</description>
    </items>
    <items>
      <name>Закрепленные</name>
      <description>Закрепленные</description>
    </items>
    <items>
      <name>Контроль</name>
      <description>Контроль</description>
    </items>
    <items>
      <name>Мои</name>
      <description>Мои</description>
    </items>
    <items>
      <name>МоиНастройки</name>
      <description>Мои настройки</description>
    </items>
    <items>
      <name>НастройкаПроцессаФилиала</name>
      <description>Настройка процесса филиала</description>
    </items>
    <items>
      <name>Отчеты</name>
      <description>Отчеты</description>
    </items>
    <items>
      <name>Планирование</name>
      <description>Планирование</description>
    </items>
    <items>
      <name>Прочие</name>
      <description>Прочие</description>
    </items>
    <items>
      <name>СпискиДокументов</name>
      <description>Списки документов</description>
    </items>
    <items>
      <name>Трудозатраты</name>
      <description>Трудозатраты</description>
    </items>
    <items>
      <name>Управление</name>
      <description>Управление</description>
    </items>
    <items>
      <name>УправлениеУслугами</name>
      <description>Управление услугами</description>
    </items>
  </predefined>
  <attributes>
    <name>БыстрыйДоступ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСчетчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Иконка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляБыстрогоДоступа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодОпределенияДоступности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетодРасчетаСчетчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектМетаданных</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/РолиПользователей/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьИнструментыСистемы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ГруппыИнструментов = ИнструментыСистемы.ПолучитьЭлементы();
	Объект.ДоступныеИнструменты.Очистить();
	
	Для Каждого Группа Из ГруппыИнструментов Цикл
		ЭлементыГруппы = Группа.ПолучитьЭлементы();
		Для Каждого Элемент Из ЭлементыГруппы Цикл
			НоваяСтрока = Объект.ДоступныеИнструменты.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Элемент);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИнструментыСистемыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущиеДанные = Элементы.ИнструментыСистемы.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.Представление <> "Отчеты" И ТекущиеДанные.Представление <> "Инструменты" Тогда
			Родитель = ТекущиеДанные.ПолучитьРодителя();
		Иначе 
			Родитель = ТекущиеДанные;
		КонецЕсли;
	КонецЕсли;
	
	Если Родитель = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ВыбратьОтчеты", Родитель.Представление = "Отчеты");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеВыбораИнструмента", ЭтотОбъект, ПараметрыОткрытия);
	ОткрытьФорму("Справочник.ИнструментыСистемы.ФормаВыбора", ПараметрыОткрытия, , , , , 
		ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнструментыСистемы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РолиПользователейДоступныеИнструменты.Инструмент КАК Инструмент,
	|	РолиПользователейДоступныеИнструменты.Порядок КАК Порядок,
	|	РолиПользователейДоступныеИнструменты.ЭтоОтчет КАК ЭтоОтчет,
	|	ИнструментыСистемы.Наименование КАК Представление
	|ИЗ
	|	Справочник.РолиПользователей.ДоступныеИнструменты КАК РолиПользователейДоступныеИнструменты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИнструментыСистемы КАК ИнструментыСистемы
	|		ПО РолиПользователейДоступныеИнструменты.Инструмент = ИнструментыСистемы.Ссылка
	|ГДЕ
	|	РолиПользователейДоступныеИнструменты.Ссылка = &Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|ИТОГИ ПО
	|	ЭтоОтчет";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЭлементыДерева = ИнструментыСистемы.ПолучитьЭлементы();
	
	СтрокаГруппа = ЭлементыДерева.Добавить();
	СтрокаГруппа.Представление = "Инструменты";

	СтрокаГруппа = ЭлементыДерева.Добавить();
	СтрокаГруппа.Представление = "Отчеты";
	
	ВыборкаГруппа = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаГруппа.Следующий() Цикл	
		Если НЕ ВыборкаГруппа.ЭтоОтчет Тогда
			СтрокаГруппа = ЭлементыДерева[0];
		Иначе
			СтрокаГруппа = ЭлементыДерева[1];
		КонецЕсли;
		
		Выборка = ВыборкаГруппа.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СтрокаИнструмент = СтрокаГруппа.ПолучитьЭлементы().Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаИнструмент, Выборка);			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИнструмента(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппыИнструментов = ИнструментыСистемы.ПолучитьЭлементы();
	
	Для Каждого Группа Из ГруппыИнструментов Цикл
		Если (ДополнительныеПараметры.ВыбратьОтчеты И Группа.Представление = "Отчеты") 
			ИЛИ (НЕ ДополнительныеПараметры.ВыбратьОтчеты И Группа.Представление = "Инструменты") Тогда
			
			ТекущаяГруппа = Группа.ПолучитьЭлементы();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ТекущаяГруппа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТекущаяГруппа.Добавить();
	НоваяСтрока.Представление = Строка(Результат);
	НоваяСтрока.Инструмент = Результат;
	НоваяСтрока.Порядок = ТекущаяГруппа.Количество();
	НоваяСтрока.ЭтоОтчет = ДополнительныеПараметры.ВыбратьОтчеты;
	
КонецПроцедуры

#КонецОбласти
